
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5700246565)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.rds.module.db.module.db_instance.aws_db_instance.this[0]
  * module.rds.module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]
  * module.rds.module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]
  * module.rds.module.db.module.db_instance.random_id.snapshot_identifier[0]
  * module.rds.module.db.module.db_option_group.aws_db_option_group.this[0]
  * module.rds.module.db.module.db_parameter_group.aws_db_parameter_group.this[0]
  * module.rds.module.db.module.db_subnet_group.aws_db_subnet_group.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.rds.module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "dev-db"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "dev-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 30
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Environment" = "dev"
        }
      + timezone                              = (known after apply)
      + username                              = "user"
      + vpc_security_group_ids                = [
          + "sg-086adb653f0bef863",
        ]

      + timeouts {}
    }

  # module.rds.module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "MyRDSMonitoringRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "MyRDSMonitoringRole"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "MyRDSMonitoringRole"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.rds.module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "MyRDSMonitoringRole"
    }

  # module.rds.module.db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "dev-db"
        }
    }

  # module.rds.module.db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "5.7"
      + name                     = (known after apply)
      + name_prefix              = "dev-db-"
      + option_group_description = "dev-db option group"
      + tags                     = {
          + "Name" = "dev-db"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-db"
        }

      + timeouts {}
    }

  # module.rds.module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "dev-db parameter group"
      + family      = "mysql5.7"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "dev-db-"
      + tags        = {
          + "Name" = "dev-db"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Name"        = "dev-db"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
    }

  # module.rds.module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "dev-db subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "dev-db-"
      + subnet_ids              = [
          + "subnet-0821c957f6d439a1a",
          + "subnet-0f676c6c810d0fbe4",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "dev-db"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Name"        = "dev-db"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":43,"Program":"tfcmt","SHA1":"4c96bf34fd96e5083bd9ec6651cb19b1679f4649","Vars":{},"WorkflowName":"dev plan"} -->